{
  "jobs": [
    {
      "company": "Cencage",
      "jobTitle": "Associate Software Quality Assurance Engineer",
      "description": "Cencage 3/30/2021\nDo you dare to have an impact on the future of education?\nAt Cengage, we're harnessing the power of tech to build a future where all learners have the tools and confidence meet our targets. As a Cengage employee, you will blaze a new trail to transform the way people learn. Collaborating with a distributed team, you'll feel challenged and encouraged to do breakthrough work. With the support of our united team, there is no limit to what you can envision, build and set in motion.\nAre we right for you?\nWe set the bar higher by bringing our outstanding talents and points of view to the table every day. We're curious and comfortable with change and are willing to accept the challenge to transform education for the better. Most importantly, we put learning first with everything we do. We also offer an appealing environment with the opportunity to work with some of the best people in our industry.\n\nWhat You'll Do Here\n\nAs an Associate Software Quality Assurance Engineer at Cengage, you will test software services and mobile applications to ensure that our systems and projects are working as designed. You will learn to apply quality standards followed by our organization, and will assist with the design, development and implementation of test plans. You will also regress bugs (with supervision), and will be given opportunities to help define direction and set goals. In this role, under moderate supervision, you will:\nCreate test plans from technical design and/or requirements documents.\nSolve issues (in QA or on live) as assigned.\nExecute manual test cases and regresses bugs with supervision.\nAssist in the review of technical and user documentation.\nAssist with reviewing test plans.\nAs needed may also help monitor the work of QA vendors.\nSkills you will need here:\n1+years of relevant software development or quality assurance experience.\nBA/BS in Computer Science or Engineering or equivalent experience.\nKnowledge of test case creation and defect management.\nFamiliarity with Agile software development, TDD and BDD concepts.\nKnowledge of programming theory for Web services and REST APIs.\nExperience testing browsers using testing tools (JIRA, Zephyr, Selenium).\nEntry-level knowledge of SQL (MySQL, Oracle) and SQL queries.\nBasic experience with scripting in Java, PHP, Ruby or C#.\nBasic knowledge of operating systems and web browsers used on Mac, Windows and Mobile devices.\nAbout Cengage\nCengage is the education and technology company built for learners. The company serves the higher education, K-12, professional, library and workforce training markets worldwide. Cengage creates learning experiences that build confidence and momentum toward the future students want. The company is headquartered in Boston, MA. Employees reside in nearly 40 countries with sales in more than 125 countries around the world. Visit us at www.cengage.com or find us on Facebook or Twitter.\n\nCengage is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, marital status, parental status, cultural background, organizational level, work styles, tenure and life experiences. Or for any other reason. You may view Cengage’s EEO/Affirmative Action Policy signed by CEO Michael Hansen and Equal Employment Opportunity is the Law notice by visiting their corresponding links.\n\nCengage provides excellent benefits (health, vision and dental, 401(k) , and three weeks vacation to start) and is committed to providing reasonable accommodations for qualified individuals with disabilities in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at accommodations.ta@cengage.com or you may call us at +1 (617) 289-7917.\nSeniority Level\nEntry level\n\nIndustry\nE-learning  Higher Education  Publishing\nEmployment Type\nFull-time\n\nJob Functions\nQuality Assurance",
      "date": "2021-03-30",
      "id": 1
    },
    {
      "company": "Charles River Laboratories",
      "jobTitle": "Software Engineer",
      "description": "Software Engineer Charles River Laboratories 3/30/2021\nAt Charles River, we are passionate about improving the quality of people’s lives. When you join our global family, you will help create healthier lives for millions of patients and their families.\n\nCharles River employees are innovative thinkers, who are dedicated to continuous learning and improvement. We will empower you with the resources you need to grow and develop in your career.\n\nAs a Charles River employee, you will be part of an industry-leading, customer-focused company at the forefront of drug development. Your skills will play a key role in bringing life-saving therapies to market faster through simpler, quicker, and more digitalized processes. Whether you are in lab operations, finance, IT, sales, or another area, when you work at Charles River, you will be the difference every day for patients across the globe.\n\nJob Summary\n\nWe are seeking an experienced Front End Developer for our Digital Team. This is a remote position with a preference that the candidate be located anywhere within the U.S, Canada or the U.K.\n\nThe Front End Developer is responsible for transforming the design and the product vision into working products and will directly influence how users will interact with the system. The Front End developer works hard to stay on top of fast changing technology and invests a lot of energy in learning new tricks. They are not only caught up on industry trends in client development frameworks but also know what the near future will bring. A love for clean interfaces and a passion for great user experiences goes without saying.\n\nEssential Duties And Responsibilities\nBuild applications according to the design and provide designers with feedback and suggest tradeoffs when required\nEnsure the code follows latest coding practices and industry standards\nWork closely with backend developers to understand and properly use the systems APIs Write both unit and integration tests, and develop automation tools for daily tasks\nChallenge ideas and opinions to avoid pitfalls and inefficient solutions\nPerform all other related duties as assigned\nJob Qualifications\n\nThe following are minimum requirements related to the Front End Developer:\nBachelor’s degree (B.A./B.S.) or equivalent in Computer Science, Engineering, Information Systems, or a related discipline\nStrong understanding of Agile methodologies.\nPast experience as a frontend developer building modern JavaScript-based web applications.\nExpert experience with HTML, CSS/LESS/SCSS/etc., JavaScript, and responsive design.\nMobile development experience with either native or web-to-native tooling and frameworks.\nExperience using JavaScript frameworks and libraries, such as React, Angular, etc.\nUnderstanding of RESTful APIs and how to use them in practice. Knowledge of Object-Oriented programing.\nAbility to write effective unit, integration, and end-user automation tests.\nExperience as a Developer on a cross-functional agile team preferred.\nExperience in Agile Development, with specific Solution Architect (or similar) experience preferred.\nAbout Safety Assessment\n\nCharles River is committed to helping our partners expedite their preclinical drug development with exceptional safety assessment services, state-of-the-art facilities and expert regulatory guidance. From individual specialty toxicology and IND enabling studies to tailored packages and total laboratory support, our deeply experienced team can design and execute programs that anticipate challenges and avoid roadblocks for a smooth, efficient journey to market. Each year approximately 120 investigational new drug (IND) programs are conducted in our Safety Assessment facilities.\n\nAbout Charles River\n\nCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients’ clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.\n\nWith over 17,000 employees within 90 facilities in 20 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client’s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2019, revenue increased to $2.62 billion.\n\nAt Charles River, we are passionate about our role in improving the quality of people’s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~85% of the drugs approved by the FDA in 2019.\n\nEqual Employment Opportunity\n\nCharles River Laboratories is an Equal Opportunity Employer - M/F/Disabled/Vet.\n\nIf you are interested in applying to Charles River Laboratories and need special assistance or an accommodation due to a disability to complete any forms or to otherwise participate in the resume submission process, please contact a member of our Human Resources team by sending an e-mail message to crrecruitment_US@crl.com. This contact is for accommodation requests for individuals with disabilities only and cannot be used to inquire about the status of applications.\n\nFor more information, please visit www.criver.com.\n\nSeniority Level\nEntry level\n\nIndustry\nResearch  Biotechnology  Pharmaceuticals\nEmployment Type\nFull-time\n\nJob Functions\nEngineering  Information Technology",
      "date": "2021-03-30",
      "id": 2
    },
    {
      "company": "RAPTOR MAPS",
      "jobTitle": "Software Engineer (Entry-Level)",
      "description": "Our Clean Energy Impact\nAbout the Position:\n\nWe’re looking for an incredibly talented full-time software engineer. You would dive right into our fast-paced, multi-faceted engineering team and learn at lightning pace.\n\nResponsibilities:\n\nDesign, build, test, deploy, and maintain software\nManage individual priorities, deadlines, and deliverables\nPrepare and participate in software design discussions and code reviews\nCommunicate and problem solve with various stakeholders such as customer facing teams, product management, and leadership.\nQualifications:\n\nYou are highly self-motivated, resourceful, and enjoy working alongside a motivated team\nYou love learning new things fast\nYou iterate to improve software and deliver products on short time scales\nYou have 1+ years of work experience in software development\nYou have experience with general purpose software programming languages (e.g. Python, Java, Javascript, etc.)\nYou hold a Bachelor’s degree in Computer Science, similar technical field of study, or equivalent practical experience.\nAll Raptor Maps Team Members\n\nHave complete ownership and accountability over their role and success in the team\nHave transparency into the operations of the rest of the company and are expected to be transparent and communicate honestly and effectively\nHave a sense of urgency. We are tackling a global problem, working in a fast-paced industry, and building a once in a lifetime company at Raptor Maps.\nLocation:\n\nWork remote, work in a Boston-based office, or take a hybrid approach. ",
      "date": "2021-03-30",
      "id": 3
    },
    {
      "company": "Pluralsight",
      "jobTitle": "Software Engineer",
      "description": "The Opportunity\nThe Assessments group at Pluralsight is expanding its platform to build new ways of engaging learners while measuring learning growth and providing guidance. Our experiences and tools support engagement through active assessment activities that help reinforce new learnings, diagnose areas for growth, and measure and celebrate achievement.\n\nWe’re hiring a Software Engineer to help build the next generation of computer-adaptive assessments. As a software engineer in the Assessments group, you’ll help shape the technical direction of our assessment engine that drives Skill IQ today, and new computer-adaptive assessments in the future. You’ll collaborate with a bright, engaging, diverse set of people that are passionate about learning and helping our learners and customers reach their learning goals by crafting scalable, secure software that delights our users.\n\nYou’d be a great fit if you have experience in any of the following:\nBuilding web applications with Python and PostgreSQL\nDesigning, building, or supporting high performance distributed systems\nContinuous Integration and Continuous Delivery platforms (GitLab)\nMessaging/queueing systems or stream processing systems like\nApache Kafka or RabbitMQ\nWriting unit tests, performing code reviews, and participating in design discussions about architecture, data shape, and business logic\nSolving analytical business problems using data\nAPI design patterns like REST\nBonus points for experience with (and/or an eagerness to learn):\nFastAPI, JavaScript, React or Node.js\nTopics related to platform scale, security, availability, deployment and operations\nDatabase and query performance tuning\nDocker and Kubernetes\n\nYou’ll Love Working With Us If You Like\nTest-Driven Development - we take responsibility for our code\nwithout QA engineers\nPair & mob programming - we value collaborative development\nContinuous Delivery - teams independently ship code to prod every day\nKanban & Lean - continuous flow\nContinual improvement - we take time to sharpen the saw and adjust how\nwe work\nAutonomous & responsible teams - making their own product & dev choices\nCross-functional teams - collaborating through all phases of the product development process\nCustomer research - we build what our customers actually want\nTrusting leaders - who trust us to create and look to us to set our own timelines\nSolid technology - of the team’s choice, for the right job\n\nYou Are\nA supportive and engaged team member\nAvidly curious, and interested in learning the ins & outs of\neducational measurement\nKind-hearted and a good communicator\nAble to distill complex ideas into straightforward language\nAble to problem solve and prioritize work based on anticipated business value.\nPassionate about data, innovation, and using technology to create with possibility.\n",
      "date": "2021-03-30",
      "id": 4
    },
    {
      "company": "HubSpot",
      "jobTitle": "Software Engineer",
      "description": "Software Engineer\nCompany NameHubSpot Company Location  Cambridge, MA 3/30/2021\nWe’re Looking For Top Engineering Talent To Join Our Small, Customer-driven Development Teams To Work On a Variety Of Projects Including\nBack End: We write lots of micro-services, primarily with Java 11. Our APIs are RESTful and use the minimal Dropwizard framework. We take advantage of Kafka, Spark, Hadoop for processing volumes of data.\nFront End: Our web applications are complex, single-page apps written in JavaScript (React, ECMAScript 6, Sass).\nCore Data, Infrastructure, & Reliability: Building the systems that power thousands of services with Singularity on Apache Mesos, and empowering access to massive datasets with HBase, Elastic Search, ZooKeeper, Redis, MySQL, and Memcached.\nContributing to our open source projects is a plus.\n\nAt HubSpot, apps are owned and developed by small, autonomous, cross-functional teams. You and your team set the goals, set the timelines, build the software, go to user tests, and carry the pager.\n\nInstead of trying to fill specific titles, we hire talented people at all seniority levels and work with them to find the role that suits them best. If you like the sound of engineering at HubSpot, please apply here so we can learn more about you.\n\nWe know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates, so please don’t hesitate to apply — we’d love to hear from you.\n\nAbout HubSpot\n\nHubSpot (NYSE: HUBS) is a leading customer relationship management (CRM) platform that provides software and support to help businesses grow better. We build marketing, sales, service, and website management products that start free and scale to meet our customers’ needs at any stage of growth. We’re also building a company culture that empowers people to do their best work through. If that sounds like something you’d like to be part of, we’d love to hear from you.\n\nYou can find out more about our company culture in the HubSpot Culture Code, which has more than 5M views, and learn about our commitment to creating a diverse and inclusive workplace, too. Thanks to the work of every employee globally, HubSpot was named the #4 Best Place to Work on Glassdoor in 2021, and has been recognized for award-winning culture by Great Place to Work, Comparably, Fortune, Entrepreneur, Inc., and more.\n\nHeadquartered in Cambridge, Massachusetts, HubSpot was founded in 2006. Today, thousands of employees work across the globe in HubSpot offices and remotely. Visit our careers website to learn more about culture and opportunities at HubSpot.\n\nBy submitting your application, you agree that HubSpot may collect your personal data for recruiting, global organization planning, and related purposes. HubSpot's Privacy Notice explains what personal information we may process, where we may process your personal information, our purposes for processing your personal information, and the rights you can exercise over HubSpot’s use of your personal information.\nSeniority Level\nEntry level\n\nIndustry\nMarketing & Advertising  Computer Software  Internet\nEmployment Type\nFull-time\n\nJob Functions\nEngineering  Information Technology\n",
      "date": "2021-03-30",
      "id": 5
    },
    {
      "company": "Oracle ",
      "jobTitle": "JET Software Developer",
      "description": "Oracle JET Software Developer 3/30/2021\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.\n\nDuties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.\n\nOracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.\n\nOracle JavaScript Extension Toolkit (JET) is an open source toolkit containing web components, services and tools that power Oracle's Cloud applications.\n\nOur developers use a variety of frontend technologies to provide a modern, flexible framework used by thousands of application developers inside and outside of Oracle.\n\nMinimum Bachelor degree preferably in Computer Science or equivalent.\n\nMinimum 12 months of work experience with the software development.\n\nProficient in client development, deep knowledge of HTML, Javascript and CSS.\n\nProficiency in Typescript and NodeJS development preferred\n\nExperience with React or other client-side javascript frameworks is preferable.\n\nJob\n\nProduct Development\n\nLocation\n\nUS-MA,Mass-Burlington\n\nJob Type\n\nRegular Employee Hire\n\nOrganization\n\nOracle\nSeniority Level\nEntry level\n\nIndustry\nMarketing & Advertising  Information Technology & Services  Staffing & Recruiting\nEmployment Type\nFull-time\n\nJob Functions\nEngineering  Information Technology",
      "date": "2021-03-30",
      "id": 6
    }
  ]
}